{"class_name": "Model", "keras_version": "2.2.4", "config": {"layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_1", "sparse": false}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_2", "sparse": false}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_3", "sparse": false}, "inbound_nodes": [], "name": "input_3"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_4", "sparse": false}, "inbound_nodes": [], "name": "input_4"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_5", "sparse": false}, "inbound_nodes": [], "name": "input_5"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_6", "sparse": false}, "inbound_nodes": [], "name": "input_6"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_7", "sparse": false}, "inbound_nodes": [], "name": "input_7"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_8", "sparse": false}, "inbound_nodes": [], "name": "input_8"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_9", "sparse": false}, "inbound_nodes": [], "name": "input_9"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_10", "sparse": false}, "inbound_nodes": [], "name": "input_10"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_11", "sparse": false}, "inbound_nodes": [], "name": "input_11"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_12", "sparse": false}, "inbound_nodes": [], "name": "input_12"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_13", "sparse": false}, "inbound_nodes": [], "name": "input_13"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_14", "sparse": false}, "inbound_nodes": [], "name": "input_14"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_15", "sparse": false}, "inbound_nodes": [], "name": "input_15"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_16", "sparse": false}, "inbound_nodes": [], "name": "input_16"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_17", "sparse": false}, "inbound_nodes": [], "name": "input_17"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_18", "sparse": false}, "inbound_nodes": [], "name": "input_18"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_19", "sparse": false}, "inbound_nodes": [], "name": "input_19"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_20", "sparse": false}, "inbound_nodes": [], "name": "input_20"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_21", "sparse": false}, "inbound_nodes": [], "name": "input_21"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_22", "sparse": false}, "inbound_nodes": [], "name": "input_22"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_23", "sparse": false}, "inbound_nodes": [], "name": "input_23"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_24", "sparse": false}, "inbound_nodes": [], "name": "input_24"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_25", "sparse": false}, "inbound_nodes": [], "name": "input_25"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_26", "sparse": false}, "inbound_nodes": [], "name": "input_26"}, {"class_name": "InputLayer", "config": {"dtype": "float32", "batch_input_shape": [null, 224, 224, 1], "name": "input_27", "sparse": false}, "inbound_nodes": [], "name": "input_27"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lambda_1"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_2", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "lambda_2"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_3", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "lambda_3"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_4", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "lambda_4"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_5", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_5", 0, 0, {}]]], "name": "lambda_5"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_6", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_6", 0, 0, {}]]], "name": "lambda_6"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_7", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_7", 0, 0, {}]]], "name": "lambda_7"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_8", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_8", 0, 0, {}]]], "name": "lambda_8"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_9", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_9", 0, 0, {}]]], "name": "lambda_9"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_10", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_10", 0, 0, {}]]], "name": "lambda_10"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_11", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "lambda_11"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_12", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_12", 0, 0, {}]]], "name": "lambda_12"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_13", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_13", 0, 0, {}]]], "name": "lambda_13"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_14", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_14", 0, 0, {}]]], "name": "lambda_14"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_15", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_15", 0, 0, {}]]], "name": "lambda_15"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_16", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_16", 0, 0, {}]]], "name": "lambda_16"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_17", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_17", 0, 0, {}]]], "name": "lambda_17"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_18", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_18", 0, 0, {}]]], "name": "lambda_18"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_19", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_19", 0, 0, {}]]], "name": "lambda_19"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_20", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_20", 0, 0, {}]]], "name": "lambda_20"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_21", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_21", 0, 0, {}]]], "name": "lambda_21"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_22", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_22", 0, 0, {}]]], "name": "lambda_22"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_23", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_23", 0, 0, {}]]], "name": "lambda_23"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_24", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_24", 0, 0, {}]]], "name": "lambda_24"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_25", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_25", 0, 0, {}]]], "name": "lambda_25"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_26", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_26", 0, 0, {}]]], "name": "lambda_26"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_27", "trainable": true, "function_type": "lambda", "arguments": {"i": 0, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_27", 0, 0, {}]]], "name": "lambda_27"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_28", "trainable": true, "function_type": "lambda", "arguments": {"i": 1, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "name": "lambda_28"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_29", "trainable": true, "function_type": "lambda", "arguments": {"i": 1, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "name": "lambda_29"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_30", "trainable": true, "function_type": "lambda", "arguments": {"i": 1, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_3", 0, 0, {}]]], "name": "lambda_30"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_31", "trainable": true, "function_type": "lambda", "arguments": {"i": 1, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_4", 0, 0, {}]]], "name": "lambda_31"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_32", "trainable": true, "function_type": "lambda", "arguments": {"i": 1, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_5", 0, 0, {}]]], "name": "lambda_32"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_33", "trainable": true, "function_type": "lambda", "arguments": {"i": 1, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_6", 0, 0, {}]]], "name": "lambda_33"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_34", "trainable": true, "function_type": "lambda", "arguments": {"i": 1, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_7", 0, 0, {}]]], "name": "lambda_34"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_35", "trainable": true, "function_type": "lambda", "arguments": {"i": 1, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_8", 0, 0, {}]]], "name": "lambda_35"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_36", "trainable": true, "function_type": "lambda", "arguments": {"i": 1, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_9", 0, 0, {}]]], "name": "lambda_36"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_37", "trainable": true, "function_type": "lambda", "arguments": {"i": 1, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_10", 0, 0, {}]]], "name": "lambda_37"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_38", "trainable": true, "function_type": "lambda", "arguments": {"i": 1, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_11", 0, 0, {}]]], "name": "lambda_38"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_39", "trainable": true, "function_type": "lambda", "arguments": {"i": 1, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_12", 0, 0, {}]]], "name": "lambda_39"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_40", "trainable": true, "function_type": "lambda", "arguments": {"i": 1, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_13", 0, 0, {}]]], "name": "lambda_40"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_41", "trainable": true, "function_type": "lambda", "arguments": {"i": 1, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_14", 0, 0, {}]]], "name": "lambda_41"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_42", "trainable": true, "function_type": "lambda", "arguments": {"i": 1, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_15", 0, 0, {}]]], "name": "lambda_42"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_43", "trainable": true, "function_type": "lambda", "arguments": {"i": 1, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_16", 0, 0, {}]]], "name": "lambda_43"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_44", "trainable": true, "function_type": "lambda", "arguments": {"i": 1, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_17", 0, 0, {}]]], "name": "lambda_44"}, {"class_name": "Lambda", "config": {"function": ["YwMAAAAKAAAABAAAAFNgAQBzqwAAAHQAAGoBAHwAAIMBAH0DAHwDAGQBACB9BAB8AwBkAQAffQUA\nfAQAfAIAGn0GAHwBAHwCAGQBABhrAgByTgB8BAB8BgB8AQAUGH0HAG4GAHwGAH0HAHQAAGoCAHwH\nAHwFAGcCAGQCAGQDAIMBAX0HAHQAAGoCAHwGAHwFAGQDABRnAgBkAgBkAwCDAQF9CAB8CAB8AQAU\nfQkAdAAAagMAfAAAfAkAfAcAgwMAUygEAAAATmkBAAAAdAQAAABheGlzaQAAAAAoBAAAAHQBAAAA\nS3QFAAAAc2hhcGV0CwAAAGNvbmNhdGVuYXRldAUAAABzbGljZSgKAAAAdAQAAABkYXRhdAEAAABp\ndAUAAABwYXJ0c1ICAAAAdAoAAABiYXRjaF9zaXpldAsAAABpbnB1dF9zaGFwZXQEAAAAc3RlcHQE\nAAAAc2l6ZXQGAAAAc3RyaWRldAUAAABzdGFydCgAAAAAKAAAAABzTQAAAC9ob21lL3RhbnlhLy5s\nb2NhbC9saWIvcHl0aG9uMi43L3NpdGUtcGFja2FnZXMva2VyYXMvdXRpbHMvbXVsdGlfZ3B1X3V0\naWxzLnB5dAkAAABnZXRfc2xpY2W3AAAAcxYAAAAAAQ8BCgEKAQoBEAERAgYBGwEfAQoB\n", null, null], "name": "lambda_45", "trainable": true, "function_type": "lambda", "arguments": {"i": 1, "parts": 2}, "output_shape": [224, 224, 1], "output_shape_type": "raw"}, "inbound_nodes": [[["input_18", 0, 0, {}]]], "name": "lambda_45"}, {"class_name": "Lambda", "config": {"function": 